{
    "id": "0",
    "title": "Visual Arts",
    "author": "Andrea Jadyn Tan",
    "img": "https://drive.google.com/thumbnail?id=1-FpoDt4t5rk-ij_L-SHs1OaZ7Ai5FE19&sz=w1024",
    "content": "<p>Mathematics can be found in various fields, including visual arts. According to the Oxford Dictionary, visual arts can be defined as “creative art whose products are to be appreciated by sight, such as painting, sculpture, and film.” On the surface, visual arts and mathematics might have nothing in common. However, visual arts is not just about painting or creating sculptures; it often involves a deep understanding of mathematical concepts such as the golden ratio, fractals, and geometric transformations. Artists often use these concepts to create balance and harmony in their works. This shows that mathematics is not only about equations or formulas, but it is also a source of inspiration for artists.</p><p>The golden ratio, denoted as <em>&phi;</em> (phi), is a mathematical constant approximately equal to 1.618. It is closely linked to the Fibonacci Sequence. Furthermore, it is also believed that the golden ratio is the most pleasing proportion to the eye, as demonstrated in many classical paintings. One of the most famous paintings exemplifying the golden ratio is The Last Supper by Leonardo Da Vinci.</p><figure><img src=\"https://drive.google.com/thumbnail?id=1-FpoDt4t5rk-ij_L-SHs1OaZ7Ai5FE19&sz=w1024\"><figcaption>Source: Lesso (2024)</figcaption></figure><p>The painting shows how Da Vinci used the golden ratio throughout his painting, using it in multiple places to create a panoramic scene with an underlying mathematical order and harmony (Lesso, 2024). Da Vinci also demonstrated the golden ratio in many of his other paintings including The Vitruvian Man and even the Mona Lisa.</p><figure><img src=\"https://drive.google.com/thumbnail?id=1-OOH0HYGNFRfg9Oa-Jo1j6U-vWlTdzdQ&sz=w1024\"><img src=\"https://drive.google.com/thumbnail?id=1-UHsjC-do2wkB9Zz2teMeRiEV4eVDoFf&sz=w1024\"><figcaption>Source: User (2023)</figcaption></figure><p>Fractals exhibit self-similarity, meaning that when you zoom in on a fractal, you will see the exact same shape as the one before. This will go on indefinitely. In nature, fractals can be found in the branching of trees, in leaves, or even in snowflakes.</p><figure><img src=\"https://drive.google.com/thumbnail?id=1-e0cQ1PL1uMS5GcL0t2LNvpTWkbnWcwg&sz=w1024\"><img src=\"https://drive.google.com/thumbnail?id=1-e9x5FC3jkxUSgN55VvwlUdjMuGdjkwN&sz=w1024\"><figcaption>Source: Patterns in Nature, Fractals (2020)</figcaption></figure><p>Not all fractals can be found in nature, some fractals are created by mathematicians such as the Koch Curve, Koch Snowflake, or the Sierpinski Triangle and some fractals are created by artists.</p><figure><img src=\"https://drive.google.com/thumbnail?id=1-eej1x124pI9ip_s_cWTmHF7G_ZaoJiN&sz=w1024\"><figcaption>Source: Musher (2015)</figcaption></figure><p>The painting, titled \"Visage of War\" 1940 by Salvador Dali, is an example of a fractal. The use of fractals can clearly be seen within the eyes and mouth of the head, as the pattern seems to be repeating over and over within the smaller heads inside the mouth and eyes of the biggest head (Musher, 2015).</p><p>Geometric transformation is a process of changing the position, size, or orientation of an image. Here are some paintings that use geometric transformation:<ol><li>Metamorphosis II by M.C. Escher<figure><img src=\"https://drive.google.com/thumbnail?id=1-evjKXCCEBIq0Xk78ChKTYDZL2RJkob9&sz=w1024\"></figure><p>In this painting, Escher used translation to create a repeating pattern. It looks like the image <img src=\"https://drive.google.com/thumbnail?id=1-fLTlNKfljbFcX5HfaX_yOUO75B0IIEV&sz=w1024\"> is slid down creating the final figure. <img src=\"https://drive.google.com/thumbnail?id=1-omtvQ0QS06mYufWKaR45oqUD9hzmqdo&sz=w1024\"></p></li><li>The Sacrament of the Last Supper by Salvador Dali<figure><img src=\"https://drive.google.com/thumbnail?id=1-re4bFcG2PyXpLW3nQp-pgUcaSYtSMwC&sz=w1024\"></figure><p>This painting is a reinterpretation of the Last Supper by Leonardo Da Vinci. It is also noticeable that the painting exhibits a flip or a reflection.</p></li><p>Moreover, there are also a lot of digital art and acrylic paintings demonstrating glide reflection with footprints in the sand.</p><li>Footprints in the Sand Digital Art by Walter Neal<figure><img src=\"https://drive.google.com/thumbnail?id=1-wr-lmb6Tzjp8sG5v0z3NXzp5yyxy9Ub&sz=w1024\"></figure></li></ol></p><p>This concludes that while visual arts and mathematics may not have anything in common up front, they are actually closely connected. The application of these mathematical concepts enhances the structure and balance of the painting, making it aesthetically pleasing in the eye.</p><h2>References</h2><p>Lesso, R. (2024, August 17). What Is the Golden Ratio and How Does it Apply to Art? TheCollector. <a href=\"https://www.thecollector.com/what-is-the-golden-ratio-and-how-does-it-apply-to-art/\">https://www.thecollector.com/what-is-the-golden-ratio-and-how-does-it-apply-to-art/</a></p><p>User, S. (2023, December 4). Examples of the golden ratio (?). Math and Music. <a href=\"https://mathandmusic.nl/en/math-around-you/examples-of-the-golden-ratio\">https://mathandmusic.nl/en/math-around-you/examples-of-the-golden-ratio</a></p><p>Fractal Foundation Online Course - Chapter 1 - FRACTALS IN NATURE. (n.d.). <a href=\"https://fractalfoundation.org/OFC/OFC-1-1.html\">https://fractalfoundation.org/OFC/OFC-1-1.html</a></p><p>Musher, A. (2015, March 2). Fractals in fine art. The History of Art and Technology. <a href=\"https://ucsdvis159.wordpress.com/2015/03/02/fractals-in-fine-art/</\">https://ucsdvis159.wordpress.com/2015/03/02/fractals-in-fine-art/</a></p>"
}