{
    "id": "1",
    "title": "Game Development",
    "author": "Menandro Siozon",
    "img":"https://upload.wikimedia.org/wikipedia/commons/6/68/Joe_Biden_presidential_portrait.jpg",
    "content": "<p>Mathematics has a wide array of applications of engineering, physics, to economics and technological applications. One of its main applications is in Game Development. freeCodeCamp (2019) defines Game Development as the art of creating games, particularly focused on the design, development, and release of a game. The Fibonacci Sequence is a sequence wherein the succeeding term is the sum of the last 2 terms (Ghose, 2024). This can be seen in various aspects of development such as Procedural Content Generation (PCG), wherein Procedural Content Generation uses the Fibonacci Sequence to create levels, environments, or landscapes that are natural, flowing, and enjoyable to look at or play for the user. An example of this is Unreal Engine 5's Procedural Content Generation system. It is a system within the Unreal Engine 5 game engine that allows a developer to easily create environments using nodes, metadata, control flows, etc. that are of quality (Procedural Content Generation Overview | Unreal Engine 5.5 Documentation | EPic Developer Community, n.d.).</p><figure><img src=\"https://drive.google.com/thumbnail?id=120qyJZgU6_fY3RowsKOU2d0IVtg-zqDN&sz=w1024\"><figcaption>(Unreal Engine 5 Procedural Content Generation System)</figcaption></figure><figure><img src=\"https://drive.google.com/thumbnail?id=123gP9kV3QNI4sbH6KW1M5-hSaL5ai3kR&sz=w1024\"><figcaption>Source: (DiLaura, 2024) - Unreal Engine 5 Procedural Content Generation</figcaption></figure><p>In addition to the Fibonacci Sequence, the Golden Ratio is used also in game development. The Golden Ratio, according to Carlson (2024), is the ratio of a line segment when cut into two pieces of different lengths wherein their quotient approximately equates to 1.618 or (1 +√5)/2. In Mathematics, this ratio is defined as the Golden Ratio as it's the most aesthetically pleasing to the human eye, something that is perfect. In game development, this is prominent in the realms of UI (User Interface) design, Camera Positioning (Camera Layout), and Aesthetic Design. An example of the golden ratio being utilized is the 2008 game, Gears of War 2. (Contributors to Game Design Snacks Wikia, n.d.) declares that the camera position in Gears of War 2 forms a Golden ratio with the height of the camera in the viewpoint, Furthermore, the surrounding buildings and architecture form a golden ratio in terms of the height and width.</p><figure><img src=\"https://drive.google.com/thumbnail?id=124_sbqysxr5lohrJmpfFRuGRCj72A5BP&sz=w1024\"><figcaption>Source: (Contributors to Game Design Snacks Wikia, n.d.)</figcaption></figure><p>In addition to the use of the Fibonacci Sequence and Golden Ratio, game development also heavily relies on the use of logic. (Mathematical Logic - New World Encyclopedia, n.d.) defines logic, particularly Mathematical Logic as a branch of logic and mathematics that deals with mathematical concepts in the form of formal logic systems. Furthermore, it explains that Mathematical Logic is subdivided into various subcategories which include Set Theory, Recursion Theory, Proof Theory, and Model Theory. In game development, logic plays a huge role in making a game that works properly, and is enjoyable to the player. Logic in a game dictates how the game functions, the various rules, and in short the game mechanics. Some notable examples of the applications of Logic include the AI (Artificial Intelligence), the various game engines such as Physics Engines, Collision Detection Systems, NPC (Non - Playable Character) behavior, movement, graphics, etc. An example of a game that utilizes logic to the fullest is the simulation racing game, Assetto Corsa.</p><figure><img src=\"https://drive.google.com/thumbnail?id=12A-79Dnz-diV09B6Z8wHMV3k-pZ7Do6J&sz=w1024\"><figcaption>Source: (Realism Ultra-PP Filter (PuRe), 2024)</figcaption></figure><p>Assetto Corsa is a simulation racing game created by the Italian Game Developer, Kunos Simulazioni, and was released back in 2014. According to fans of the game, and in general, they praise the realism of the game, wherein the car's feel in line with their real life counterparts. (Patrick, 2017) declares that the game's physics engine is fantastic, especially when connected with a dedicated racing wheel. The realism in the game's physics, along with the other aspects like the graphics (Assetto Corsa - Is This the Real Life?, 2016), can be attributed to the game's robust engines of which all are governed by the principles of logic. The logic behind the game's engine allows it to achieve the feel and realism that players currently enjoy. Logic allows the game to be well balanced across all aspects from the AI (Artificial Intelligence) opponents, Physics Engine, Graphics Engine, etc. all of which contribute to the strong form of the game currently despite being 10 years old.</p><h2>References</h2><p>Contributors to Game Design Snacks Wikia. (n.d.). The use of Golden Ratio in Camera Positioning,Game Interface Design and Environment Layout. Game Design Snacks Wikia. <a href=\"https://game-design-snacks.fandom.com/wiki/The_Use_of_Golden_Ratio_in_Camera_Positioning,Game_Interface_Design_and_Environment_Layout.\">https://game-design-snacks.fandom.com/wiki/The_Use_of_Golden_Ratio_in_Camera_Positioning,Game_Interface_Design_and_Environment_Layout.</a></p><p>Procedural Content Generation Overview | Unreal Engine 5.5 Documentation | EPic Developer Community. (n.d.). Epic Games Developer. <a href=\"https://dev.epicgames.com/documentation/en-us/unreal-engine/procedural-content-generation-overview\">https://dev.epicgames.com/documentation/en-us/unreal-engine/procedural-content-generation-overview</a></p><p>Mathematical logic - New World Encyclopedia. (n.d.). <a href=\"https://www.newworldencyclopedia.org/entry/Mathematical_logic\">https://www.newworldencyclopedia.org/entry/Mathematical_logic</a></p><p>Assetto Corsa - Is this the real life? (n.d.). <a href=\"https://www.dedoimedo.com/games/assetto-corsa-first-review.html\">https://www.dedoimedo.com/games/assetto-corsa-first-review.html</a></p><p>Carlson, S. C. (2024, October 21). Golden ratio | Examples, Definition, & Facts. Encyclopedia Britannica. <a href=\"https://www.britannica.com/science/golden-ratio\">https://www.britannica.com/science/golden-ratio</a></p><p>freeCodeCamp. (2019, December 28). What is game development? freeCodeCamp.org. <a href=\"https://www.freecodecamp.org/news/what-is-game-development/\">https://www.freecodecamp.org/news/what-is-game-development/</a></p><p>Ghose, T. (2024, November 6). What is the Fibonacci sequence? livescience.com. <a href=\"https://www.livescience.com/37470-fibonacci-sequence.html\">https://www.livescience.com/37470-fibonacci-sequence.html</a></p>"
}