{
    "id": "3",
    "title": "Machine Learning",
    "author": "Joramm Fredrik Dela Torre",
    "img":"https://drive.google.com/thumbnail?id=12oPfc77x4JAxhSNbqq42fJC_QCmE52Ng&sz=w1024",
    "content": "<p>In recent years, there has been an increase in the creation of Artificial Intelligence (A.I). This is one of the most often talked about due to the capabilities of some A.I since A.I are created to function like the cognitive minds of humans so A.I are able to think and make decisions like a human would. In the creation of these A.I, one method in making A.I is using machine learning, this method uses data and algorithms to train the machine to think and make decisions like a human.</p><p>In order for an A.I to think like a human, it needs guidance in the form of logic. Logic allows the A.I to make decisions, analyze problems, solve complex problems, and process the information(Enlitia, 2024).</p><figure><img src=\"https://drive.google.com/thumbnail?id=12oPfc77x4JAxhSNbqq42fJC_QCmE52Ng&sz=w1024\"></figure><p>One application of logic in the field of Machine Learning is the Adam or also known as the Automated Discovery and Analysis Machine. Adam is considered as a robot scientist with a physically implemented robotic system. This machine applies techniques from A.I to execute an automated scientific experimentation. Adam is capable of automatically executing cycles of formulating a hypothesis, executing the experiment with automated laboratory equipment and as well as analysis of the results. Adam successfully identified the function of some genes in yeast which makes Adam the first automated machine that is able to discover non-trivial scientific information.  Logic is used in formulating the hypothesis, the results, and the conclusion of the experiment.</p><figure><img src=\"https://drive.google.com/thumbnail?id=12peztg7ZdUaCtaivM5G-hh7DZoE7byrN&sz=w1024\"></figure><p>Furthermore, logic is used in a subfield of A.I called Inductive Logic Programming(ILP). ILP employs logic programming to represent instances, background information, and hypotheses. It uses first-order logic to represent and justify hypotheses and data in structured data and background knowledge. It is advantageous in bioinformatics and natural language processing, and uses \"upgrades\" propositional machine learning systems to solve classification, regression, clustering, and reinforcement learning challenges (Jeevanandam, 2023). One of the early applications of ILP  is where one creates a program that takes a small amount of input and output like letting a computer decide whether an input is even or odd. Inductive programming saves scientists a lot of time as a large portion is used to write programs to transform data, in which inductive programming can be used to clean data and transform data(Sundarg, 2019).</p><figure><img src=\"https://drive.google.com/thumbnail?id=12s_KQCo74B35ueZVta0uxCgf_8SFIT4u&sz=w1024\"></figure><p>Automation of Mathematical Reasoning, a subfield of A.I, however the methods of automating reasonings is unique enough that it can be considered separate. In automated mathematical reasoning which uses logic to give a program  a set of assumptions in which the program will make logical inferences towards a designated goal. This can be used to prove theorems, checking proofs, and designing circuits. These programs are commonly used to prove theorems by providing algorithmic descriptions, problem classification, language representation, and deductive inference implementation (Gillis, n.d.). Not only that it is primarily used in deductive reasoning, verification of mathematical proofs, and ensuring no errors are made in calculations.</p><p>In conclusion, mathematical logics are used in Machine Learning, albeit there are a lot of machine learning systems discovered and created including automated discovery, inductive programming and automation of mathematical reasoning.</p><section><p>Gillis, A. (n.d.). What is automated reasoning? | Definition from TechTarget. Search Enterprise AI. Retrieved November 26, 2024, from <a href=\"https://www.techtarget.com/searchenterpriseai/definition/automated-reasoning\">https://www.techtarget.com/searchenterpriseai/definition/automated-reasoning</a></p><p>King, Ross & Rowland, Jem & Oliver, Stephen & Young, Meong & Aubrey, Wayne & Byrne, Emma & Liakata, Maria & Markham, Magdalena & Pir, Pinar & Soldatova, Larisa & Sparkes, Andrew & Whelan, Ken & Clare, Amanda. (2009). The Automation of Science. Science (New York, N.Y.). 324. 85-9. 10.1126/science.1165620.</p><p>King, R. (2017). The Adam and Eve Robot Scientists for the Automated Discovery of Scientific Knowledge. 2017, X49.001. APS March Meeting Abstracts.</p><p>Sundarg, N. (2019, August 9). An Overview of Logic in AI and Machine Learning. Abacus.AI Blog (Formerly RealityEngines.AI). <a href=\"https://medium.com/abacus-ai/an-overview-of-logic-in-ai-and-machine-learning-2f41ccb2a335\">https://medium.com/abacus-ai/an-overview-of-logic-in-ai-and-machine-learning-2f41ccb2a335</a></p><p>Types of Logic in AI | Enlitia. (2024, January 15). <a href=\"https://www.enlitia.com/resources-blog-post/types-of-logic-in-ai\">https://www.enlitia.com/resources-blog-post/types-of-logic-in-ai</p></section>"
}