{
    "id": "5",
    "title": "Summary and Reflections",
    "author": "Justin Ryan Uy",
    "img": "https://upload.wikimedia.org/wikipedia/commons/e/ea/Yanghui_triangle.gif",
    "content": "<p>From ancient architectural wonders to modern digital worlds, the beauty of mathematics lives on. In humanity's expressions of faith and love, despair and loss, mathematics remains a constant. In the past, we use mathematical patterns to build grand monuments and paint lustrous images, allowing for further discovery and societal progression. We continue this tradition up to the contemporary age, especially with the rise of AI technologies. At its core, machine learning requires deep pattern recognition to do its job, algorithms that have been derived from the great mathematical solutions of the past and present. Be it not for the initial recognition of mathematical precision in nature, we would not have been able to develop such immense technology today. We thank our ancestors in understanding the beauty of the math in the world around them, and, as part of the same human species, we hope to follow in their footsteps, so that onne day, our descendants may do the same.</p><section><h1>Reflections</h1><h2>Joramm Fredrik Dela Torre</h2><p>This project helped me widen my perspective and appreciation for math. Researching mathematics used in Machine Learning taught me about applying math knowledge to different branches of AI, a branch that I aimed to learn more about. AI and Machine Learning are something I wanted to learn about and given this chance to study mathematics application, a subject I quite like, made me appreciate it even more. It surprises me how far we have advanced with technology that even machines are capable of research using the logic of humans. I deeply appreciate the effort of humanity to create machines that are capable ease the difficulty of some tedious work. Mathematics is truly a blessing to us, it is capable of making our day-to-day living a lot easier.</p><h2>Anie Guo</h2><p>In the past, I mostly saw mathematics in textbooks or test papers. When I used mathematics, it was also for answering questions, counting scores, or calculating accounts. However, after this project, I realized that mathematics is not limited to this. Mathematics is everywhere, and many things around us are inseparable from mathematics, such as the electronic devices, tables, and chairs we are using now. Through this project, I learned more about the uses of mathematics and I believe that I will use this knowledge one day in the future.</p><h2>Menandro Siozon</h2><p>Because of this project, I realized that Mathematics is actually more multidimensional than I initially thought. Prior to this, I only associated Mathematics with things like engineering, construction, graphs, formulas, etc. However, after all the research and brainstorming, I realized that Mathematics is everywhere and that Mathematics is a foundational aspect and factor in why the world is as advanced and as sophisticated as it is. For instance, through this project, I only realized that through my experience in 3D Modelling and Environment Creation with Unreal Engine 5, I was inadvertently utilizing the theories of Fibonacci Sequence, Golden Ratio, and Logic to create environments that are flowing, beautiful, and enjoyable. In summary, this project has deepened my appreciation of Mathematics as it has opened my eyes to how vast and multifaceted Mathematics is.</p><h2>Andrea Jadyn Tan</h2><p>Through this project, I was able to realize that mathematics is all around us, that there are a lot of real-life examples of mathematics. Prior to doing this project, I was always taught that mathematics is only about solving equations, graphing functions, or memorizing formulas. But this project showed me that mathematics can still be found in places where you least expected it to be, from the intricate patterns of nature to the architecture of buildings. Overall, this project has deepened my understanding of mathematics, and I am grateful for the opportunity to have worked on this project.</p><h2>Justin Ryan Uy</h2><p></p></section>"
}