[
    {
        "title": "Project Proposal",
        "date": "2024-11-04",
        "img": "https://drive.google.com/thumbnail?id=13FwrWq-7DFlg_s09yWTH4EHj6YAXvjtJ&sz=w1024",
        "content": "We first begin with submitting our project proposal, containing the proposed fields and tasks for each member. This ensures that everyone is on the same page and that the project progresses smoothly.</p>"
    },
    {
        "title": "Start of Website",
        "date": "2024-11-15",
        "img": "https://drive.google.com/thumbnail?id=13DSjZCJCeVU1hLUzVyKvJvMmPyccz6ck&sz=w1024",
        "content": "During this day, Justin started drafting the website, which is our main platform for presenting this project. Our website includes an introduction, articles, a summary, reflections, a timeline, and the members of the group.</p>"
    },
    {
        "title": "Articles",
        "date": "2024-11-17",
        "img": "https://drive.google.com/thumbnail?id=13CXirZ83EzIaN80jzOO9g98_Hj_UyWu7&sz=w1024",
        "content": "We start writing articles about the proposed fields. Each member begins to write articles in their proposed field. After writing the article, the members check the content of the articles with each other. On Nov. 26, we finalized the articles in each proposed field."
    },
    {
        "title": "Introduction, Summary, Reflection",
        "date": "2024-11-29",
        "img": "https://drive.google.com/thumbnail?id=13AswwaPt97kYYSUIJ34068aZbSPVT-il&sz=w1024",
        "content": "Justin and Andrea started writing the introduction and Justin started writing the summary. Reflection is done by all members. On Dec. 2, we finished the introduction, summary, and reflection."
    },
    {
        "title": "Revision",
        "date": "2024-11-30",
        "img": "https://drive.google.com/thumbnail?id=13AVBBM_7DocClYajL7oe6PdZJk6Kt1FG&sz=w1024",
        "content": "Justin rechecked the articles and revised some grammatical errors to ensure the accuracy and quality of the website."
    },
    {
        "title": "Documentation",
        "date": "2024-12-01",
        "img": "https://drive.google.com/thumbnail?id=138QszxY7HrPA7uDtCtDufHulEC0_6GGa&sz=w1024",
        "content": "During this day, Andrea and Anie begin to complete the documentation. A timeline is made to show the completion of the project."
    },
    {
        "title": "Final Submission",
        "date": "2024-12-03",
        "img": "https://drive.google.com/thumbnail?id=13GmZVaSISOWgjWqGCLqRVKV3QoIG1usj&sz=w1024",
        "content": "We submitted the finished website. With that, we are proud of what we have accomplished, and grateful that our hard work has paid off."
    }
]